//
/*******************************************
 * ************变量命名**********************
 * *****************************************
 * *****************************************
 */
// 常量命名用大写字母
var MMS_FRAME, LIMITE_TIME
// 字符串命名最好以str开头
var strTips = '提示信息'
// 数字开头最好以num开头
var numReward = 1000
// 数组开头最好以开头
var arrCity = ['北京', '上海']
// 布尔值最好以is、has、can开头
var isShow = false
var hasApple = true
var canDoit = true
// 如果一个属性可能的值不止两个最好不要采用布尔值 
var typeStatus = 1
// 返回结果最好是result这样的语意命名
var result = 'abc'
// 私有变量最好前置加上_
var obj = {firstName: '张', secondName: '三', age: 18}
obj._name = obj.firstName + obj.secondName


/*******************************************
 * ************变量的使用**********************
 * *****************************************
 * *****************************************
 */
// 不好的方法：
if(a == b && b == c && c==d){  
  //有些复杂了    
}
// 好的方法：
var isOk = (a == b && b == c && c==d)
if(isOk) {
  // ok
}


/*******************************************
 * ************空格的使用规范**********************
 * *****************************************
 * *****************************************
 */
// 参数的逗号后面跟一个空格
var foo = function(name1, name2, name3){

}
// 冒号的前后各放一个空格
var strPosition = a > b ? 'top' : 'botoon'
// for语句的分号后面跟一个空格
for(i = 0; i < 10; i++ ){

}